Revit 2027 API
Category.BuiltInCategory Property
 Gets the BuiltInCategory value for this category.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public BuiltInCategory BuiltInCategory { get; }
Public ReadOnly Property BuiltInCategory As BuiltInCategory
	Get
public:
property BuiltInCategory BuiltInCategory {
	BuiltInCategory get ();
}
member BuiltInCategory : BuiltInCategory with get
Property Value
BuiltInCategory
 BuiltInCategory value for the category or INVALID if the category is not a built-in category.
See Also
Reference
Category Class
Autodesk.Revit.DB Namespace